# Список- это объект, который содержит многочисленные элементы данных. Списки являются мутирующими последовательностями,
# т. е. их содержимое может изменяться во время выполнения программы. Списки являются динамическими структурами данных,
# т. е. элементы в них могут добавляться или удаляться из них. Для работы со списками
# в программе можно применять индексацию, нарезку и другие разнообразные методы.
list1 = []
list2 = list()
even_numbers = [2, 4, 6, 8, 10]
names = [ 'Молли' , ' Стивен ' , 'Уилл ' , 'Апиция ' , 'Адриана ' ]
info = [ 'Апиция', 27, 1550.87]