# Списки имеют многочисленные методы, которые позволяют работать с содержащимися в них значениями.
#  Python также предлагает несколько встроенных функций, которые широко используются для работы со списками.
# арреnd(значение)  -  Добавляет значение в конец списка
# index (значение)  -  Возвращает индекс первого элемента, значение которого равняется значению.
#                                 Если значение в списке не найдено, то вызывается исключение ValueError.
# insert (индекс, значение)   -   Вставляет значение в заданную индексную позицию в списке.
# sort ()  -  Сортирует значения в списке, в результате чего они появляются в возрастающем порядке (начиная с наименьшего значения до наибольшего)
# rеmоvе(значение)   -   Удаляет из списка первое появление значения. Если значение в списке не найдено, то вызывается исключение ValueError.
# reverse ()  -  Инвертирует порядок следования значений в списке, т. е. меняет его на противоположное