'''
Инструкция i f применяется для создания управляющей структуры, которая позволяет
иметь в программе более одного пути исполнения. Инструкция i f исполняет одну или
несколько инструкций, только когда булево выражение является истинным.
'''
'''
В Python для написания структуры принятия решения с единственным вариантом используется инструкция if. 
Вот общий формат инструкции if:
if условие:
    инструкция
    инструкция
    . . .
'''
if sales > 5000:
    bonus = 500.0
    commission_rate = 12
    print('Вы вьmолнили свою квоту продаж!')