'''Список -
 это объект, который содержит многочисленные элементы данных. Списки
являются мутируемыми последовательностями, т. е. их содержимое может изменяться во
время исполнения программы. Списки являются динамическими структурами данных,
т. е. элементы в них могут добавляться или удаляться из них. Для работы со списками
в программе можно применять индексацию, нарезку и другие разнообразные методы.'''
even_numbers = [2 , 4, 6, 8, 10 ]
names = ['Молли', 'Стивен', 'Уилл', 'Алисия', 'Адриана']
print(names)
numbers = list(range(1, 6))
print(numbers)