'''
Инструкция if-else исполняет один блок инструкций, если ее условие является истинным, либо другой блок, если ее условие является ложным.
'''
'''
В программном коде мы записываем структуру принятия решения с двумя альтернативными
вариантами, как инструкцию if-else. Вот общий формат инструкции if-else:
if условие:
    инструкция
    инструкция
else:
    инструкция
    инструкция
'''
temperature = 10
if temperature < 5: print("Холодновато, не находишь?")
else: print("Отличная погодка у нас сегодня!")